Repository: LeonidVolohov/JSONEditor
Catalog: jsoneditor-python3.2-PyQt5.5.1/utils/locale/*/LC_MESSAGES/MainWindow.po
Languages: ru_ru

source: New string
ru_ru: Новая строка

source: untilted
ru_ru: без названия

source: File
ru_ru: Файл

source: New
ru_ru: Новый

source: Open
ru_ru: Открыть

source: Save
ru_ru: Сохранить

source: Save As...
ru_ru: Сохранить как...

source: Refresh
ru_ru: Обновить

source: Quit
ru_ru: Выйти

source: Editable
ru_ru: Редактировать

source: Case sensitive
ru_ru: С учетом регистра

source: Column - Value
ru_ru: Столбец - Значение

source: View
ru_ru: Вид

source: Find
ru_ru: Найти

source: Expand
ru_ru: Раскрыть

source: Collapse
ru_ru: Сжать

source: All
ru_ru: Полностью

source: To Level
ru_ru: До уровня

source: Color
ru_ru: Цвет

source: None
ru_ru: Без цвета

source: Yellow
ru_ru: Желтый

source: Orange
ru_ru: Оранжевый

source: Red
ru_ru: Красный

source: Green
ru_ru: Зеленый

source: Blue
ru_ru: Синий

source: Purple
ru_ru: Фиолетовый

source: Grey
ru_ru: Серый

source: Column - All
ru_ru: Столбец - Все

source: Choose JSON File
ru_ru: Выберите JSON файл

source: Failed to save file. Choose `Save As...` function.
ru_ru: Не удалось сохранить файл. Выберите `Сохранить как...` опцию.

source: FileNotFoundError exception in action_save_json_file() function: %s
ru_ru: FileNotFoundError исключение в action_save_json_file() функции: %s

source: OSError exception in action_save_json_file() function: %s
ru_ru: OSError исключение в action_save_json_file() функции: %s

source: BaseException in action_save_json_file() function: %s
ru_ru: BaseException исключение в action_save_json_file() функции: %s

source: Save File
ru_ru: Сохранить файл

source: FileNotFoundError exception in action_save_json_file_as() function: %s
ru_ru: FileNotFoundError исключение в action_save_json_file_as() функции: %s

source: OSError exception in action_save_json_file_as() function: %s
ru_ru: OSError исключение в action_save_json_file_as() функции: %s

source: BaseException in action_save_json_file_as() function: %s
ru_ru: BaseException исключение в action_save_json_file_as() функции: %s

source: FileNotFoundError exception in action_refresh_json_file() function: %s
ru_ru: FileNotFoundError исключение в action_refresh_json_file() функции: %s

source: OSError exception in action_refresh_json_file() function: %s
ru_ru: OSError исключение в action_refresh_json_file() функции: %s

source: BaseException in action_refresh_json_file() function: %s
ru_ru: BaseException исключение в action_refresh_json_file() функции: %s

source: Application needs to be restarted!
ru_ru: Приложение необходимо перезагрузить!

source: Information
ru_ru: Информация

source: Add Item
ru_ru: Добавить элемент

source: Add string
ru_ru: Добавить строку

source: Add integer
ru_ru: Добавить число

source: Add boolean
ru_ru: Добавить логич.

source: Add object()
ru_ru: Добавить объект()

source: Add list()
ru_ru: Добавить список()

source: Insert Child
ru_ru: Добавить подэлемент

source: Insert child string
ru_ru: Добавить подстроку

source: Insert child integer
ru_ru: Добавить подчисло

source: Insert child boolean
ru_ru: Добавить подлогич.

source: Insert child object()
ru_ru: Добавить подобъект()

source: Insert child list()
ru_ru: Добавить подсписок()

source: Delete Item
ru_ru: Удалить элемент

source: Open File
ru_ru: Открыть файл

source: IndexError exception in open_right_click_menu() function: %s
ru_ru: IndexError исключение в open_right_click_menu() функции: %s

source: BaseException in open_right_click_menu() function: %s
ru_ru: BaseException исключение в open_right_click_menu() функции: %s

source: New int
ru_ru: Новое число

source: New bool
ru_ru: Новое логич. значение

source: You can only use this function to root QTreeView Node, choose another actions
ru_ru: Данную функцию можно использовать только для корневого элемента, выберите другую опцию

source: Exception in tree_add_item() function: %s
ru_ru: Исключение в функции tree_add_item(): %s

source: Exception in tree_add_item_child() function: %s
ru_ru: Исключение в функции tree_add_item_child(): %s

source: Exception in tree_item_delete() function: %s
ru_ru: Исключение в функции tree_item_delete(): %s

source: Exception in tree_item_open_json_file() function: %s
ru_ru: Исключение в функции tree_item_open_json_file(): %s

source: Warning
ru_ru: Предупреждение

source: Critical
ru_ru: Ошибка

source: Save changes to file before closing?
ru_ru: Сохранить изменения перед выходом?
